[CX_PsiArmor X2ArmorTemplate]
FriendlyName="Psi Armor"
FriendlyNamePlural="Psi Armors"
BriefSummary="The Psi Armor as we call it is nothing more than a Psionically enhanced suit. While it does not offer any added protection in the way of hardened armor, it does highten the wearers own mental state. This suit offers the wearer added health, mobility, defense and above all else, higher will. This suit also grants any Psi Soldier an added Psi Offensive boost."
TacticalText="<Bullet/>Grants bonuses to Health, Mobility, Defense, Will and Psi Offense.<Bullet/>NOTE: The Psi Offense boost will only benefit a Psi Soldier."


[PsiArmorTech X2TechTemplate]
DisplayName="Psi Armor"
Summary="The Psi Armor as we call it is nothing more than a Psionically enhanced suit. While it does not offer any added protection in the way of hardened armor, it does highten the wearers own mental state. This suit offers the wearer added health, mobility, defense and above all else, higher will. This suit also grants any Psi Soldier an added Psi Offensive boost."
CodeName="Omega"
LongDescription="The Psi Armor as we call it is nothing more than a Psionically enhanced suit. While it does not offer any added protection in the way of hardened armor, it does highten the wearers own mental state. This suit offers the wearer added health, mobility, defense and above all else, higher will. This suit also grants any Psi Soldier an added Psi Offensive boost."



[Obbe_PsiHeadGear_Male X2BodyPartTemplate]
DisplayName="Obbe_PsiHeadGear_Male"

